@extends('url.layouts.layout')
@section('content')
<p><h3>Сокращение URL</h3>
    — возможность, используемая в Интернете и сервис.
Используется в тех случаях, когда необходимо иметь дополнительный короткий (альтернативный) URL-адрес для
доступа к веб-странице.
</p>
<p>
    <h3>Экономия длины сообщения</h3>
    Сокращение URL помогает создавать более короткие адреса. В Twitter или IM-программах даже 60-символьный URL
    может быть слишком длинным (например, в Twitter размер сообщения был изначально ограничен 140 символами).
</p>

<h3>Предотвращение ненамеренного искажения URL</h3>
В настоящее время веб-разработчики часто передают в URL параметры для представления иерархии данных, команды,
пути загрузки или информацию о сессии. Это нередко отражается на URL, что делает его сложным для восприятия и запоминания.
URL-адреса, в которых 100 и более знаков, при частом копировании могут по неаккуратности быть скопированы не полностью,
что сделает ссылку нерабочей.
Тогда как короткий URL удобен для копирования в письма e-mail или сообщения на форумах.

@stop